[ { "key"       : "kskd2010",
    "bibtex"    : "bib/led2012-sky-phenomena.bib",
    "title"     : "Anisotropic Kuwahara Filtering with Polynomial Weighting Functions",
    "date"      : "2010-06-01",
    "authors"   : [ "Jan Eric Kyprianidis", "Amir Semmo", "Henry Kang", "Jürgen Döllner" ],
    "published" : "In NPAR Poster Session / Proceedings EG UK Theory and Practice of Computer Graphics",
    "caption"   : "In this work we present new weighting functions for the anisotropic Kuwahara filter. The anisotropic Kuwahara filter is an edge-preserving filter that is especially useful for creating stylized abstractions from images or videos. It is based on a generalization of the Kuwahara filter that is adapted to the local shape of features. For the smoothing process, the anisotropic Kuwahara filter uses weighting functions that use convolution in their definition. For an efficient implementation, these weighting functions are therefore usually sampled into a texture map. By contrast, our new weighting functions do not require convolution and can be efficiently computed directly during the filtering in real-time. We show that our approach creates output of similar quality as the original anisotropic Kuwahara filter and present an evaluation scheme to compute the new weighting functions efficiently by using rotational symmetries.",
    "thumbnail" : "/img/2012-vmv-day-and-night-sky.jpg",
    "downloads" : [
    { "href"  : "http://hpi.de/fileadmin/user_upload/fachgebiete/doellner/publications/2010/KSKD10a/jkyprian-npar2010.pdf",
      "desc"  : "Paper (PDF)"
    } ],
    },
	
  { "key"       : "wsash2010",
    "bibtex"    : "bib/led2012-sky-phenomena.bib",
    "title"     : "ContextLua: Dynamic Behavioral Variations in Computer Games",
    "date"      : "2010-06-01",
    "authors"   : [ "Benjamin Hosain Wasty", "Amir Semmo", "Malte Appeltauer", "Bastian Steinert", "Robert Hirschfeld" ],
    "published" : "In Proceedings of the 2nd International Workshop on Context-Oriented Programming",
    "caption"   : "Behavioral variations are central to modern computer games as they are making the gameplay a more interesting user experience. However, these variations significantly add to the implementation complexity. We discuss the domain of computer games with respect to dynamic behavioral variations and argue that context-oriented programming is of special interest for this domain. This motivates our extension to the dynamic scripting language Lua, which is frequently used in the development of computer games. Our newly provided programming constructs allow game developers to use layers for defining and activating variations of the basic gameplay.",
    "thumbnail" : "/img/2012-vmv-day-and-night-sky.jpg",
    "downloads" : [
	{ "href"    : "http://dx.doi.org/10.1145/1930021.1930026",
      "desc"    : "DOI"
    },
    { "href"  : "http://hpi.de/fileadmin/user_upload/fachgebiete/doellner/publications/2010/KSKD10a/jkyprian-npar2010.pdf",
      "desc"  : "Paper (PDF)"
    } ],
    },
	
  { "key"       : "tsphdeh2010",
    "bibtex"    : "bib/led2012-sky-phenomena.bib",
    "title"     : "Communication of Digital Cultural Heritage in Public Spaces by the Example of Roman Cologne",
    "date"      : "2010-11-01",
    "authors"   : [ "Matthias Trapp", "Amir Semmo", "Rafael Pokorski", "Claus-Daniel Herrmann", "Jürgen Döllner", "Michael Eichhorn", "Michael Heinzelmann" ],
    "published" : "In Proceedings of 3rd EuroMed Conference",
    "caption"   : "The communication of cultural heritage in public spaces such as museums or exhibitions, gain more and more importance during the last years. The possibilities of interactive 3D applications open a new degree of freedom beyond the mere presentation of static visualizations, such as pre-produced video or image data. A user is now able to directly interact with 3D virtual environments that enable the depiction and exploration of digital cultural heritage artefacts in real-time. However, such technology requires concepts and strategies for guiding a user throughout these scenarios, since varying levels of experiences within interactive media can be assumed. This paper presents a concept as well as implementation for communication of digital cultural heritage in public spaces, by example of the project Roman Cologne. It describes the results achieved by an interdisciplinary team of archaeologists, designers, and computer graphics engineers with the aim to virtually reconstruct an interactive high-detail 3D city model of Roman Cologne.",
    "thumbnail" : "/img/2012-vmv-day-and-night-sky.jpg",
    "downloads" : [
    { "href"  : "http://hpi.de/fileadmin/user_upload/fachgebiete/doellner/publications/2010/TSPHDEH10/EuroMed2010Coloniad3D_CRC_HQ.pdf",
      "desc"  : "Paper (PDF)"
    },
    { "href"  : "hhttp://www.authorstream.com/Presentation/autopilot-645625-colonia3d/",
      "desc"  : "Slides (Authorstream)"
    },
    { "href"  : "http://www.youtube.com/watch?v=HoC_mmy51CE",
      "desc"  : "Video (YouTube)",
      "video" : "youtube"
    } ],
    },
	
  {	"key"       : "skd2010",
    "bibtex"    : "bib/led2012-sky-phenomena.bib",
    "title"     : "Automated Image-Based Abstraction of Aerial Images",
    "date"      : "2010-03-01",
    "authors"   : [ "Amir Semmo", "Jan Eric Kyprianidis", "Jürgen Döllner" ],
    "published" : "In Proceedings of 13th AGILE International Conference on Geographic Information Science",
    "caption"   : "Aerial images represent a fundamental type of geodata with a broad range of applications in GIS and geovisualization. The perception and cognitive processing of aerial images by the human, however, still is faced with the specific limitations of photorealistic depictions such as low contrast areas, unsharp object borders as well as visual noise. In this paper we present a novel technique to automatically abstract aerial images that enhances visual clarity and generalizes the contents of aerial images to improve their perception and recognition. The technique applies non-photorealistic image processing by smoothing local image regions with low contrast and emphasizing edges in image regions with high contrast. To handle the abstraction of large images, we introduce an image tiling procedure that is optimized for post-processing images on GPUs and avoids visible artifacts across junctions. This is technically achieved by filtering additional connection tiles that overlap the main tiles of the input image. The technique also allows the generation of different levels of abstraction for aerial images by computing a mipmap pyramid, where each of the mipmap levels is filtered with adapted abstraction parameters. These mipmaps can then be used to perform level-of-detail rendering of abstracted aerial images. Finally, the paper contributes a study to aerial image abstraction by analyzing the results of the abstraction process on distinctive visible elements in common aerial image types. In particular, we have identified a high abstraction straction potential in landscape images and a higher benefit from edge enhancement in urban environments.",
    "thumbnail" : "/img/2012-vmv-day-and-night-sky.jpg",
    "downloads" : [
    { "href"    : "http://dx.doi.org/10.1007/978-3-642-12326-9_19",
      "desc"    : "DOI"
    },
	{ "href"  : "http://hpi.de/fileadmin/user_upload/fachgebiete/doellner/publications/2010/SKD10/asemmo-agile2010.pdf",
      "desc"  : "Paper (PDF)"
    } ],
    },

    { "key"       : "tsd2011",
      "bibtex"    : "bib/lwtd2013-web-based-swmaps.bib",
      "title"     : "Interactive Software Maps for Web-Based Source Code Analysis",
      "date"      : "2011-05-01",
      "authors"   : [ "Matthias Trapp", "Amir Semmo", "Jürgen Döllner" ],
      "published" : "In Proceedings 9. Konferenz Kultur und Informatik - Multimediale Systeme",
      "caption"   : "Dieser Beitrag stellt die Ergebnisse des interdisziplinären Projektes Colonia3D - Visualisierung des Römischen Kölns vor. Die digitale 3D Rekonstruktion des antiken Köln ist das Ergebnis eines gemeinsamen Forschungsprojekts des Archäologischen Instituts der Universität zu Köln, der Köln International School of Design (KISD) der Fachhochschule Köln, des Hasso-Plattner Instituts an der Universität Potsdam und des Römisch Germanischen Museums (RGM) Köln. Der Beitrag präsentiert die wesentlichen Konzepte dieses interaktiven, auf Museen ausgerichteten 3D-Informationssystems, beschreibt verschiedene Präsentationsmodi und deren technische Umsetzung. Er diskutiert Vorgehensweisen und Interaktionskonzepte, die den Benutzer während der Erkundung und Bewegung im virtuellen 3D-Stadtmodell unterstützen. Weiter werden die Techniken für den Austausch, die Aufbereitung und die Optimierung komplexer 3D-Datensätze beschrieben sowie Potenziale für digitale Museen und Ausstellungen skizziert. Der vorgestellte Ansatz stellt insbesondere eine IT-Lösung für einen vereinfachten, räumlich-kontextintegrierten informellen Wissenszugang zu archäologischer Fachinformation dar.",
      "thumbnail" : "/img/2013-web3d-interactive-software-maps.jpg",
    },

    { "key"       : "std2011",
      "bibtex"    : "bib/ld2014-parameter-painting.bib",
      "title"     : "Ansätze zur kartographischen Gestaltung von 3D-Stadtmodellen",
      "date"      : "2011-04-01",
      "authors"   : [ "Daniel Limberger", "Jürgen Döllner" ],
      "published" : "In Proceedings 31. Wissenschaftlich-Technische Jahrestagung der DGPF",
      "caption"   : "Interaktive virtuelle 3D-Stadtmodelle haben sich zu einem bewährten Medium für die effektive und effiziente Kommunikation von Geoinformation entwickelt. Sie präsentieren eine spezialisierte Form geovirtueller Umgebungen und sind gekennzeichnet durch ein zugrunde liegendes 3D-Geländemodell, einer darin befindlichen 3D-Bebauung sowie des dazu komplementären Straßen-, Grünflächen- und Naturraumes. 3D-Stadtmodell-Systeme ermöglichen es dem Nutzer, sich im Modell interaktiv zu bewegen und sie stellen die Grundfunktionen für die Exploration, Analyse, Präsentation und das Editieren der raumbezogenen Information bereit. Besonders im Gebiet der kartenähnlichen und kartenverwandten 3D-Darstellungen stellen u.a. automatische Verfahren und Techniken zur Stilisierung und Abstraktion von Objekten eines 3D Stadtmodell ein Hauptproblem für die interaktive 3D-Bildsynthese dar. Hier spielt insbesondere die Abstraktion und Illustration potentiell wichtiger Information und somit die Reduzierung der kognitiven Belastung des Nutzers eine tragende Rolle. Diesbezüglich sind Verfahren und Techniken zur nicht-photorealistischen Bildsynthese ein bewährtes Mittel der Computergrafik, deren direkte Anwendung auf ein komplettes 3D-Stadtmodell jedoch häufig monotone sowie gestalterisch und kartographisch stark eingeschränkte Resultate liefert. Eine effiziente und kontextsensitive Kommunikation von 3D-Geoinformation bedarf jedoch der Kopplung von Objektsemantik und Abstraktionsverfahren. Diese Arbeit präsentiert ein Konzept und dessen Umsetzung, das die Auswahl und Parametrisierung von nicht-photorealistischen Darstellungstechniken auf Basis von Objektsemantiken erlaubt (Abbildung 1). Dies ermöglicht die Zuweisung unterschiedlicher automatischer Abstraktionstechniken zu Objekten und Objektgruppen. Der vorgestellte Ansatz ist echtzeitfähig und erlaubt eine interaktive Klassifikation von Objekten und Features zur Laufzeit, wodurch sich u.a. Szenarien zur interaktiven Exploration von thematisch-stilisierten Features bzw. feature-bezogenen Daten visualisieren lassen. Dieser Ansatz eröffnet Möglichkeiten für eine gezielte und systematische kartographische Gestaltung von 3D-Stadtmodellen sowie deren echtzeitfähige Implementierung durch entsprechende 3D-Visualisierungsdienste.",
      "thumbnail" : "/img/2014-expressive-painting-per-pixel-parametrization.jpg",
      "flickr"    : "72157650124474077",
      "downloads" : [
      { "href"    : "https://drive.google.com/file/d/0B9sUajZRijJAZm1GSHhKdHNvdjg/view",
        "desc"    : "Poster (PDF, 19.1 MiB)"
      } ],
	}, 

    { "key"       : "shtd2012",
      "bibtex"    : "bib/lwtd2013-web-based-swmaps.bib",
      "title"     : "Concepts for Cartography-Oriented Visualization of Virtual 3D City Models",
      "date"      : "2012-06-01",
      "authors"   : [ "Amir Semmo", "Dieter Hildebrandt, "Matthias Trapp", "Jürgen Döllner" ],
      "published" : "In Proceedings 9. Konferenz Kultur und Informatik - Multimediale Systeme",
      "caption"   : "Virtual 3D city models serve as an effective medium with manifold applications in geoinformation systems and services. To date, most 3D city models are visualized using photorealistic graphics. But an effective communication of geoinformation significantly depends on how important information is designed and cognitively processed in the given application context. One possibility to visually emphasize important information is based on non-photorealistic rendering, which comprehends artistic depiction styles and is characterized by its expressiveness and communication aspects. However, a direct application of non-photorealistic rendering techniques primarily results in monotonic visualization that lacks cartographic design aspects. In this work, we present concepts for cartography-oriented visualization of virtual 3D city models. These are based on coupling non-photorealistic rendering techniques and semantics-based information for a user, context, and media-dependent representation of thematic information. This work highlights challenges for cartography-oriented visualization of 3D geovirtual environments, presents stylization techniques and discusses their applications and ideas for a standardized visualization. In particular, the presented concepts enable a real-time and dynamic visualization of thematic geoinformation.",
      "thumbnail" : "/img/2013-web3d-interactive-software-maps.jpg",
	  "downloads" : [
	  { "href"    : "http://dx.doi.org/10.1127/1432-8364/2012/0131",
      "desc"    : "DOI"
      },
      { "href"    : "http://hpi.de/fileadmin/user_upload/fachgebiete/doellner/publications/2012/SHTD2012/asemmo-PFG2012.pdf",
        "desc"    : "Paper (PDF)"
      } ],
    },

    { "key"       : "shtd2012",
      "bibtex"    : "bib/lwtd2013-web-based-swmaps.bib",
      "title"     : "Towards Comprehensible Digital 3D Maps",
      "date"      : "2012-11-01",
      "authors"   : [ "Sebastian Pasewaldt, "Amir Semmo", "Matthias Trapp", "Jürgen Döllner" ],
      "published" : "In Proceedings 9. Konferenz Kultur und Informatik - Multimediale Systeme",
      "caption"   : "VDigital mapping services have become fundamental tools in economy and society to provide domain experts and non-experts with customized, multi-layered map contents. In particular because of the continuous advancements in the acquisition, provision, and visualization of virtual 3D city and landscape models, 3D mapping services, today, represent key components to a growing number of applications, like car navigation, education, or disaster management. However, current systems and applications providing digital 3D maps are faced by drawbacks and limitations, such as occlusion, visual clutter, or insufficient use of screen space, that impact an effective comprehension of geoinformation. To this end, cartographers and computer graphics engineers developed design guidelines, rendering and visualization techniques that aim to increase the effectiveness and expressiveness of digital 3D maps, but whose seamless combination has yet to be achieved. This work discusses potentials of digital 3D maps that are based on combining cartography-oriented rendering techniques and multi-perspective views. For this purpose, a classification of cartographic design principles, visualization techniques, as well as suitable combinations are identified that aid comprehension of digital 3D maps. According to this classification, a prototypical implementation demonstrates the benefits of multi-perspective and non-photorealistic rendering techniques for visualization of 3D map contents. In particular, it enables (1) a seamless combination of cartography-oriented and photorealistic graphic styles while (2) increasing screen-space utilization, and (3) simultaneously directing a viewer’s gaze to important or prioritized information.",
      "thumbnail" : "/img/2013-web3d-interactive-software-maps.jpg",
	  "downloads" : [
      { "href"    : "http://www.hpi.uni-potsdam.de/fileadmin/user_upload/fachgebiete/doellner/publications/2012/PSTD2012/PSTD_2012_SOMAP.pdf",
        "desc"    : "Paper (PDF)"
      } 
	  { "href"  : "http://www.hpi.uni-potsdam.de/fileadmin/user_upload/fachgebiete/doellner/publications/2012/PSTD2012/somap2012_pasewaldt_towards_comprehensible_3D_maps.pdf",
        "desc"  : "Slides (PDF)"
      } ],
    },

  } ]
